<?php
echo "1.ログ(意味、確認の仕方)"."<br>";
echo "コンピュータの記録。アクセスログ、エラーログ、デバックログ等がある。ログ管理システムで確認可能。"."<br>";
echo "2.クラウドサーバー、レンタルサーバー、VPSの違い"."<br>";
echo "ホスティング・クラウド事業者からサーバーをレンタルするサービス。"."<br>".
"クラウドサーバー...1台のサーバーに複数のサーバーを複数サイトで共有可能。ホテル。"."<br>".
"レンタルサーバー...1台のサーバーのCPUやメモリを複数のユーザーで共有。シェアハウス。";
echo "3.PHPのFWの種類と特徴"."<br>";
echo "①Laravel...簡単なアプリケーションを自動生成。"."<br>".
"②Cake PHP...日本語に翻訳されたドキュメントが多い。テーブルの一覧、追加や削除といったPHPプログラムが自動生成。"."<br>".
"③Phalcon...C言語の拡張。非常に高速で動作。"."<br>".
"④FuelPhp...シンプルでフレキシブルをテーマにしている小規模案件向け。"."<br>".
"⑤Yii...軽量なキャッシュ機能。アクセス負荷が大きいサービス向け。";
?>